In [2]:
import pandas as pd
import numpy as np

In [5]:
obj = pd.Series([1,3,5,7,9],index = ['a','b','c','d','e'])
obj

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [7]:
obj.reindex(['a','c'])

a    1
c    5
dtype: int64

In [9]:
obj.reindex(['a','c','b','d','e'])

a    1
c    5
b    3
d    7
e    9
dtype: int64

In [11]:
obj.reindex(['a','c','b','d','e','2'])

a    1.0
c    5.0
b    3.0
d    7.0
e    9.0
2    NaN
dtype: float64

In [14]:
frame=pd.DataFrame(np.arange(9).reshape(3,3), 
             index=['a','b','c'], 
             columns=['台北', '台中', '高雄'])
frame

   台北  台中  高雄
a   0   1   2
b   3   4   5
c   6   7   8

In [16]:
frame.reindex(['a','b'])

   台北  台中  高雄
a   0   1   2
b   3   4   5

In [18]:
frame.reindex(['a','b'],columns=['台北','高雄'])

   台北  高雄
a   0   2
b   3   5

In [20]:
#drop()
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [23]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [25]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [27]:
data.drop(['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [30]:
data.drop(['one','two'],axis=1)

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [32]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [35]:
data.loc['台北',['one','two','three']]

one      0
two      1
three    2
Name: 台北, dtype: int32

In [37]:
data.iloc[0,0:3]

one      0
two      1
three    2
Name: 台北, dtype: int32

In [39]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: 台南, dtype: int32

In [41]:
data.iloc[[1,2],[3, 0, 1]]

    four  one  two
台中     7    4    5
台南    11    8    9